app/views/user_mailer/borrow_request_confirmation_email.text.erb

SELECT  "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
---
<% if @lender.user_profile.first_name != "" %>