app/views/user_profiles/_change_profile.html.erb

          <%= a.label :province_id, "Provinces"%><br>
          <%= a.collection_select :province_id,
          Province.order(:province), :id, :province, :selected => '1',
          :class => 'form-control' %>
---
SELECT "provinces".* FROM "provinces" ORDER BY "provinces"."province" ASC