app/views/user_profiles/lend_to_others.html.erb

              <% if !(item.borrow_requests.nil?) %>
              <% item.borrow_requests.each do |borrow_request| %>
---
SELECT "borrow_requests".* FROM "borrow_requests" WHERE "borrow_requests"."item_id" = $1  [["item_id", 1]]