app/views/items/_form.html.erb

SELECT "categories".* FROM "categories" ORDER BY "categories"."category_name" ASC
---
    <%= form.label :category_id, "Categories"%><br>
    <%= form.collection_select :category_id, Category.order(:category_name), :id, :category_name,
    include_blank: true, :class => 'form-control' %>