app/views/items/show.html.erb


            <%- if !@item.borrow_requests.empty? && current_user.id != @owner.id%>
---
SELECT "borrow_requests".* FROM "borrow_requests" WHERE "borrow_requests"."item_id" = $1  [["item_id", 1]]
SELECT  1 AS one FROM "borrow_requests" WHERE "borrow_requests"."item_id" = $1 LIMIT $2  [["item_id", 1], ["LIMIT", 1]]

                    </tr>
                    <% @item.borrow_requests.each do |current_req|%>
---
SELECT "borrow_requests".* FROM "borrow_requests" WHERE "borrow_requests"."item_id" = $1  [["item_id", 1]]

<!-- comment area -->
<% if !@item.comments.empty?%>
---
SELECT "comments".* FROM "comments" WHERE "comments"."item_id" = $1  [["item_id", 5]]
SELECT  1 AS one FROM "comments" WHERE "comments"."item_id" = $1 LIMIT $2  [["item_id", 7], ["LIMIT", 1]]


        <% @item.comments.each do |current_req|%>
---
SELECT "comments".* FROM "comments" WHERE "comments"."item_id" = $1  [["item_id", 7]]