app/controllers/application_controller.rb

  def item_status_check
    #check and update status for all the items..
    if !current_user.nil?
      @comment_user = UserProfile.find(current_user.id)
    end
    @all_items = Item.all
    @all_items.each do |status_item|
      @item_ava = true
      status_item.borrow_requests.each do |request|
        if request.approval == true
          #check if any accepted items lend out today
          if (((request.borrow_date >= Date.today) && (request.return_status != 2)) || (request.return_status == 3) || (request.return_status == 4))
            @item_ava = false
          end
        end
      end
      status_item.update_attribute(:status, @item_ava)
---
SELECT "items".* FROM "items"
SELECT "borrow_requests".* FROM "borrow_requests" WHERE "borrow_requests"."item_id" = $1  [["item_id", 1]]
UPDATE "items" SET "status" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["status", false], ["updated_at", "2018-12-03 01:30:23.064448"], ["id", 1]]

  def new_message
    @new_message = false
    @message_num = 0
    @new_requests = Array.new
    if !current_user.nil?
      @current_user_profile = UserProfile.find(current_user.id)
      @user_name = @current_user_profile.username
      # checking if there are importance request message?
      @current_user_profile.items.each do |it|
        it.borrow_requests.each do |req|
          if !req.read_status
            @new_message = true
            @message_num = @message_num + 1
            @new_requests << req.id
            #flash[:notice] = "You have new requset"
          elsif req.return_status == 0 && req.borrow_date <= Date.today && req.approval
            @new_message = true
            @message_num = @message_num + 1
            @new_requests << req.id
            #flash[:notice] = "have items need to be deliverd today"
          elsif req.return_status == 1
            @new_message = true
            @message_num = @message_num + 1
            @new_requests << req.id
            #flash[:notice] = "You item returned"
          end
        end
      end
      @current_user_profile.borrow_requests.each do |req|
---
SELECT  "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."user_profile_id" = $1  [["user_profile_id", 1]]
SELECT "borrow_requests".* FROM "borrow_requests" WHERE "borrow_requests"."user_profile_id" = $1  [["user_profile_id", 1]]
SELECT  "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]