app/controllers/borrow_requests_controller.rb

SELECT  "borrow_requests".* FROM "borrow_requests" WHERE "borrow_requests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @borrow_request = BorrowRequest.find(params[:id])
    @item = Item.find(params[:item_id])

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."user_profile_id" = $1  [["user_profile_id", 2]]
SELECT  "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "borrow_requests".* FROM "borrow_requests" WHERE "borrow_requests"."item_id" = $1  [["item_id", 1]]
INSERT INTO "borrow_requests" ("item_id", "user_profile_id", "borrow_date", "return_date", "request_message", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT  "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    @item = Item.find(params[:item_id])
    @owner = @item.user_profile
    @attr = request_params
    @attr[:user_profile_id] = current_user.id
    @borrow_date = @attr[:return_date].to_date
    @return_date = @attr[:borrow_date].to_date
    @item.borrow_requests.each do |request|
      if !request.approval.nil?
        if request.approval && !@borrow_date.nil? && !@return_date.nil? && request.return_status!=2
          if request.borrow_date <= @borrow_date && request.return_date >= @borrow_date
            flash[:notice] = "please check borrow period"
            @attr[:return_date] = "1995-01-01"
          elsif request.borrow_date <= @return_date && request.return_date >= @return_date
            flash[:notice] = "please check borrow period"
            @attr[:borrow_date] = "1995-01-01"
          end
        end
      end
    end
    if @borrow_date.nil? || @borrow_date.nil?
      @attr[:return_date] = "1995-01-01"
      @attr[:borrow_date] = "1995-01-01"
    end
    @borrow_request = @item.borrow_requests.create(@attr)

    if @borrow_request.save
      flash[:notice] = "Borrow request created."

      UserMailer.with(lender: @item.user_profile.user, borrower: current_user, item: @item, borrow_request: @borrow_request).borrow_request_confirmation_email.deliver_later

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "borrow_requests".* FROM "borrow_requests" WHERE "borrow_requests"."item_id" = $1 AND "borrow_requests"."id" = $2 LIMIT $3  [["item_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "borrow_requests" SET "approval" = $1, "updated_at" = $2 WHERE "borrow_requests"."id" = $3  [["approval", true], ["updated_at", "2018-12-03 01:30:21.726147"], ["id", 1]]
SELECT "borrow_requests".* FROM "borrow_requests" WHERE "borrow_requests"."user_profile_id" = $1  [["user_profile_id", 1]]
SELECT "items".* FROM "items" WHERE "items"."user_profile_id" = $1  [["user_profile_id", 1]]
SELECT  "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "borrow_requests" SET "return_status" = $1, "updated_at" = $2 WHERE "borrow_requests"."id" = $3  [["return_status", 3], ["updated_at", "2018-12-03 01:30:28.099240"], ["id", 1]]
UPDATE "borrow_requests" SET "updated_at" = $1, "actual_return_date" = $2 WHERE "borrow_requests"."id" = $3  [["updated_at", "2018-12-03 01:31:10.711646"], ["actual_return_date", "2018-12-02"], ["id", 1]]
UPDATE "borrow_requests" SET "updated_at" = $1, "actual_borrow_date" = $2 WHERE "borrow_requests"."id" = $3  [["updated_at", "2018-12-03 01:30:45.576459"], ["actual_borrow_date", "2018-12-02"], ["id", 1]]
---
  def update
    @item = Item.find(params[:item_id])
    @borrow_request = @item.borrow_requests.find(params[:id])
    @borrower = @borrow_request.user_profile.user

    #if click Accept || Reject, update approval
    if !params[:approval].nil?
      @borrow_request.update_attribute(:approval, params[:approval])

      if @borrow_request.approval == true
        flash[:notice] = "You have approved this request"
        UserMailer.with(lender: current_user, borrower: @borrower, item: @item, borrow_request: self).borrow_request_approved_email.deliver
      elsif @borrow_request.approval == false
        flash[:notice] = "You have rejected this request"
        UserMailer.with(lender: current_user, borrower: @borrower, item: @item, borrow_request: self).borrow_request_rejected_email.deliver
      end
    end

    # Update the return status
    if !params[:return_status].nil?
      @borrow_request.update_attribute(:return_status, params[:return_status])

      if @borrow_request.return_status == 1 #borrower return
        flash[:notice] = "set return status as borrower returned(1)"
      elsif @borrow_request.return_status == 2 #lender received
        flash[:notice] = "set return status as lender received (2)"
        @borrow_request.item.status = true
        @borrow_request.update_attribute(:actual_return_date, Date.today)
      elsif @borrow_request.return_status == 3 #lender sended
        @borrow_request.item.status = false
      elsif @borrow_request.return_status == 4 #borrow received
        @borrow_request.update_attribute(:actual_borrow_date, Date.today)

UPDATE "borrow_requests" SET "read_status" = $1, "updated_at" = $2 WHERE "borrow_requests"."id" = $3  [["read_status", true], ["updated_at", "2018-12-03 01:30:17.681668"], ["id", 1]]
---
    end

    if !params[:read_status].nil? && params[:read_status] == "true"
      @borrow_request.update_attribute(:read_status, params[:read_status])

UPDATE "borrow_requests" SET "updated_at" = $1, "borrower_read_status" = $2 WHERE "borrow_requests"."id" = $3  [["updated_at", "2018-12-03 01:30:23.025375"], ["borrower_read_status", false], ["id", 1]]
---
    end

    if !params[:borrower_read_status].nil?
      @borrow_request.update_attribute(:borrower_read_status, params[:borrower_read_status])