app/controllers/comments_controller.rb

  def new
    @tryid = params[:tryid]
    @item_id = params[:item_id]
    @item = Item.find(@item_id)
    @owner = @item.user_profile
    @user_id = current_user.id
    #also need to check history
    @item.comments.each do |com|
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."user_profile_id" = $1  [["user_profile_id", 1]]
SELECT  "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."item_id" = $1  [["item_id", 6]]

  def create

    @user_profile = UserProfile.find(params.require(:comment)[:tryid])
    @l_rating = @user_profile.lend_rating
    @l_people = @user_profile.lpeople
    @l_rating = @l_rating * @l_people
    @l_people = @l_people + 1
    @rating = params.require(:comment)
    @rating = @rating[:lend_rating].to_i
    @l_rating = (@l_rating + @rating) / @l_people

    @item = Item.find(params[:item_id])
    @attr = comment_params
    @attr[:user_profile_id] = current_user.id
    @attr[:comment_date]=Time.now
    @comment = @item.comments.create(@attr)

    if @comment.save && @user_profile.update_attribute(:lend_rating, @l_rating) && @user_profile.update_attribute(:lpeople, @l_people)
---
SELECT  "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
INSERT INTO "comments" ("item_id", "user_profile_id", "comment_date", "comment_message", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "user_profiles" SET "lend_rating" = $1, "updated_at" = $2 WHERE "user_profiles"."id" = $3  [["lend_rating", 1], ["updated_at", "2018-12-03 03:03:16.362086"], ["id", 2]]