app/controllers/items_controller.rb

SELECT  "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."user_profile_id" = $1  [["user_profile_id", 1]]
---
  def index
    @unlogin = params[:user_profile_id].nil?
    @notsearching = params[:q].nil?
    @search = Item.ransack(params[:q])

    if !@notsearching
      @search_items = @search.result(distinct: true)
      @search_words = params[:q][:item_name_or_description_cont]
    elsif !@unlogin
      @user_profile = UserProfile.find(params[:user_profile_id])
      @search_items = @user_profile.items
      @search_words = ""
    else
      @search_items = Item.all

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "borrow_requests".* FROM "borrow_requests" WHERE "borrow_requests"."user_profile_id" = $1  [["user_profile_id", 1]]
SELECT "items".* FROM "items" WHERE "items"."user_profile_id" = $1  [["user_profile_id", 1]]
SELECT  "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @unlogin = params[:user_profile_id].nil?

    @item = Item.find(params[:id])
    #  @borrow_request = @item.borrow_request
    @borrow_requests = @item.borrow_requests
    @owner = UserProfile.find(@item.user_profile.id)

SELECT  "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "items" ("category_id", "item_name", "user_profile_id", "status", "created_at", "updated_at", "description") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["category_id", 7], ["item_name", "dsf"], ["user_profile_id", 1], ["status", true], ["created_at", "2018-12-02 02:20:54.521865"], ["updated_at", "2018-12-02 02:20:54.521865"], ["description", ""]]
UPDATE "items" SET "updated_at" = $1 WHERE "items"."id" = $2  [["updated_at", "2018-12-02 02:20:54.547716"], ["id", 1]]
---
  def create
    @user_profile = UserProfile.find(params[:user_profile_id])
    @item = @user_profile.items.create(item_params)

    if @item.save

SELECT  "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @user_profile = UserProfile.find(params[:user_profile_id])