app/controllers/user_profiles_controller.rb

  def show
    @user_profile = UserProfile.find(params[:id])
---
SELECT  "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def edit
    @user_profile = UserProfile.find(params[:id])
---
SELECT  "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @id = params[:id]

    if (@id.to_i == current_user.id)
      @user_profile = UserProfile.find(params[:id])
      @registerInProgress = @user_profile.birthday.nil?
      @updateResult = @user_profile.update(profile_params)

      if @updateResult && !@registerInProgress
        @user_profile.errors.clear
        flash[:notice] = "Profile updated"
        redirect_to @user_profile
      elsif @updateResult && @registerInProgress
        @user_profile.errors.clear
        flash[:notice] = "Profile added"
        redirect_to :root
      else
        flash[:error] = @user_profile.errors.full_messages.map(&:inspect).join()
        render "edit"
      end
    else
      @lrating = params.require(:user_profile)
      @lrating = @lrating[:lend_rating].to_i
      if (@lrating!=0)
        puts "22222222"
        @user_profile = UserProfile.find(params[:id])
---
SELECT  "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "user_profiles" SET "birthday" = $1, "username" = $2, "first_name" = $3, "last_name" = $4, "address" = $5, "latitude" = $6, "longitude" = $7, "updated_at" = $8 WHERE "user_profiles"."id" = $9

        @rating = params.require(:user_profile)
        @rating = @rating[:lend_rating].to_i
        @l_rating = (@l_rating + @rating) / @l_people
        if @user_profile.update_attribute(:lend_rating, @l_rating) && @user_profile.update_attribute(:lpeople, @l_people)
---
UPDATE "user_profiles" SET "lend_rating" = $1, "updated_at" = $2 WHERE "user_profiles"."id" = $3  [["lend_rating", 5], ["updated_at", "2018-12-03 01:30:54.707144"], ["id", 1]]

        end
      else
        puts "333333333"
        @user_profile = UserProfile.find(params[:id])
---
SELECT  "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

        @rating = params.require(:user_profile)
        @rating = @rating[:borrow_rating].to_i
        @b_rating = (@b_rating + @rating) / @b_people
        if @user_profile.update_attribute(:borrow_rating, @b_rating) && @user_profile.update_attribute(:bpeople, @b_people)
---
UPDATE "user_profiles" SET "borrow_rating" = $1, "updated_at" = $2 WHERE "user_profiles"."id" = $3  [["borrow_rating", 5], ["updated_at", "2018-12-03 02:08:05.511213"], ["id", 2]]

  def lend_to_others
    @user_profile = UserProfile.find(current_user.id)
---
SELECT  "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]

  def borrow_from_others
    @user_profile = UserProfile.find(current_user.id)
---
SELECT  "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]

  def lend_rating
    @user_profile = UserProfile.find(params[:id])
---
SELECT  "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def borrow_rating
    @user_profile = UserProfile.find(params[:id])
---
SELECT  "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]