app/controllers/welcome_controller.rb

  def index

    if user_signed_in?
      @current_user = User.find(current_user.id)
      @current_user_profile = @current_user.user_profile
      @user_name = @current_user_profile.username
      # checking if there are importance request message?
      @current_user_profile.items.each do |item|
        item.borrow_requests.each do |request|
          if !request.read_status
            #flash[:notice] = "new requsets incoming"
          elsif request.return_status == 3 && request.borrow_date <= Date.today
            #flash[:notice] = "have items need to be deliverd now"
          elsif request.return_status == 1
            #flash[:notce] = "You item returned"
          end
        end
      end
      @current_user_profile.borrow_requests.each do |request|
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."user_profile_id" = $1  [["user_profile_id", 1]]
SELECT "borrow_requests".* FROM "borrow_requests" WHERE "borrow_requests"."item_id" = $1  [["item_id", 1]]
SELECT "borrow_requests".* FROM "borrow_requests" WHERE "borrow_requests"."user_profile_id" = $1  [["user_profile_id", 1]]