app/models/user.rb

  def create_user_profile_entry
    @email_name = self.email[/[^@]+/]
    @email_name.gsub!(".","")
    @new_username = "#{@email_name}#{rand(1000)}"

    UserProfile.create([{ user_id: self.id, username: @new_username}])
---
INSERT INTO "user_profiles" ("user_id", "username", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["username", "estherchenliyu104"], ["created_at", "2018-12-02 02:19:58.320919"], ["updated_at", "2018-12-02 02:19:58.320919"]]