app/models/user_profile.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "user_profile_id" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["user_profile_id", 1], ["updated_at", "2018-12-02 02:19:58.538802"], ["id", 1]]
---
  def update_profile_id_in_users
    @user = User.find(self.user_id)
    if @user.present?
      @user.update_attribute(:user_profile_id, self.id)