app/views/application/_top_banner.erb

        <% @new_requests.each do |req_id|%>
          <% @new_req = BorrowRequest.find(req_id)%>
---
SELECT  "borrow_requests".* FROM "borrow_requests" WHERE "borrow_requests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]